fbiego/dt78-esp32-firmware/src/main.cpp
    Serial.print("BTN1: ");
    Serial.println(dur);
    if (actScr == ui_testScreen)
    {
      lv_arc_set_value(ui_buttonDown, 0);
    }

    if (dur > DEBOUNCE)
    {
      if (screenOn)
      {
        if (actScr == ui_testScreen)
        {
          screenOn = true;
          onTime = millis();
        }
        else if (actScr != ui_menuScreen)
        {
          load_screen(1);
        }
        else
        {
          load_screen(watchFace);
        }
      }
      else
      {
        screenOn = true;
        onTime = millis();
      }
    }
  }
}

void checkButton2()
{

  button2State = digitalRead(BT2); // read the button state on the pin "BUTTON_PIN"
  lv_disp_t *display = lv_disp_get_default();
  lv_obj_t *actScr = lv_disp_get_scr_act(display);
  if (button2State)
  {
    startPress2 = millis();
    //    Serial.print("HIGH - ");
    // button was pressed, currently high
    if (actScr == ui_testScreen)
    {
      lv_arc_set_value(ui_buttonUp, 1);
    }
  }
  else
  {
    long dur = millis() - startPress2;

    Serial.print("BTN2: ");
    Serial.println(dur);
    if (actScr == ui_testScreen)
    {
      lv_arc_set_value(ui_buttonUp, 0);
    }

    if (dur > DEBOUNCE)
    {
      if (screenOn)
      {

        if (actScr == ui_watchScreen)
        {
          screenOn = false;
        }
        else if (actScr == ui_testScreen)
        {
          screenOn = true;
          onTime = millis();
        }
        else
        {
          load_screen(watchFace);
        }
      }
      else
      {
        screenOn = true;
        onTime = millis();
      }
    }
  }
}

void theme_change(lv_event_t *e)
{
  lv_obj_t *picker = lv_event_get_target(e);
  // val = lv_slider_get_value(picker); //
  lv_color_t c = lv_colorwheel_get_rgb(picker);
  lv_disp_t *display = lv_disp_get_default();
  lv_theme_t *theme = lv_theme_default_init(display, c, lv_palette_main(LV_PALETTE_RED),
                                            true, LV_FONT_DEFAULT);
  lv_disp_set_theme(display, theme);
  lv_obj_set_style_img_recolor(ui_hourIcon1, c, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_img_recolor(ui_hourIcon2, c, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_img_recolor(ui_minuteIcon1, c, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_img_recolor(ui_minuteIcon2, c, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_color(ui_timeSeparator, c, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_color(ui_dateText, c, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_bg_color(ui_stepsProgress, c, LV_PART_INDICATOR | LV_STATE_DEFAULT);
}

static void event_handler(lv_event_t *e)
{
  lv_event_code_t code = lv_event_get_code(e);
  lv_obj_t *obj = lv_event_get_target(e);
  lv_obj_t *parent = lv_obj_get_parent(obj);

  lv_disp_t *display = lv_disp_get_default();
  lv_obj_t *actScr = lv_disp_get_scr_act(display);

  if (code == LV_EVENT_CLICKED)
  {
    if (parent == ui_messageList && actScr == ui_messageListScreen)
    {
      uint32_t i;
      for (i = 0; i < lv_obj_get_child_cnt(parent); i++)
      {
        lv_obj_t *child = lv_obj_get_child(parent, i);
        lv_state_t st = lv_obj_get_state(child);
        if (st == LV_STATE_FOCUSED)
        {
          sMsg = cMsg - i;
          break;
        }
      }

      load_screen(3);
    }
    else
    {
      if (actScr == ui_menuScreen)
      {

        if (obj == ui_buttonSettings)
        {
          load_screen(2);
        }
        if (obj == ui_buttonMessages)
        {
          load_screen(4);
        }
        if (obj == ui_buttonAbout)
        {
          load_screen(5);
        }
        if (obj == ui_buttonFind)
        {
          load_screen(6);
        }
      }
    }
  }
}

static void slider_event_cb(lv_event_t *e)
{
  lv_obj_t *slider = lv_event_get_target(e);
  if (slider == ui_brightnessSlider)
  {
    brightness = (int)lv_slider_get_value(slider);
  }
  if (slider == ui_powerSlider)
  {
    int v = (int)lv_slider_get_value(slider);
    lv_event_code_t code = lv_event_get_code(e);
    int opc = 255 - (v * 2.55);
    int opd = 100 - v;
    lv_obj_set_style_bg_opa(ui_powerSlider, opc, LV_PART_INDICATOR | LV_STATE_DEFAULT);
    lv_obj_set_style_bg_opa(ui_powerSlider, opd, LV_PART_MAIN | LV_STATE_DEFAULT);
    if (v > 50 && v <= 90)
    {
      lv_label_set_text(ui_powerText, "Light sleep");
    }
    else if (v > 90)
    {
      lv_label_set_text(ui_powerText, "Deep sleep");
    }

    if (code == LV_EVENT_RELEASED)
    {
      if (v > 50 && v <= 90)
      {
        lv_slider_set_value(ui_powerSlider, 0, LV_ANIM_ON);
        light_sleep();
      }
      else if (v > 90)
      {
        deep_sleep();
      }
      else
      {
        lv_slider_set_value(ui_powerSlider, 0, LV_ANIM_ON);
        lv_label_set_text(ui_powerText, "Slide to power off");
      }
    }
  }
}

static void button_event_handler(lv_event_t *e)
{
  lv_event_code_t code = lv_event_get_code(e);

  if (code == LV_EVENT_PRESSED)
  {
    motor = true;
  }
  else if (code == LV_EVENT_RELEASED)
  {
    motor = false;
  }
}

void switch_event_cb(lv_event_t *e)
{
  lv_event_code_t code = lv_event_get_code(e);
  lv_obj_t *obj = lv_event_get_target(e);
  if (obj == ui_autoScreenSwitch)
  {
    autoScreen = lv_obj_has_state(ui_autoScreenSwitch, LV_STATE_CHECKED);
  }
  if (obj == ui_bluetoothSwitch)
  {
    bool state = lv_obj_has_state(ui_bluetoothSwitch, LV_STATE_CHECKED);
    if (state)
    {
      BLEDevice::startAdvertising();
    }
    else
    {
      BLEDevice::stopAdvertising();
      power_save();
    }
  }
  if (code == LV_EVENT_VALUE_CHANGED)
  {
  }
}

void my_gesture(lv_event_t *e)
{
  lv_obj_t *screen = lv_event_get_current_target(e);
  lv_dir_t dir = lv_indev_get_gesture_dir(lv_indev_get_act());
  switch (dir)
  {
  case LV_DIR_LEFT: // <<<<<
    if (screen == ui_aWatch || screen == ui_gWatch || screen == ui_solarScreen || screen == ui_hWatch)
    {
      if (watchFace < 0)
      {
        watchFace++;
        load_screen(watchFace);
      }
      // load_screen(2);
    }
    if (screen == ui_textScreen)
    {
      load_screen(watchFace);
    }

    break;
  case LV_DIR_RIGHT: // >>>>>
    if (screen == ui_watchScreen || screen == ui_gWatch || screen == ui_solarScreen || screen == ui_hWatch)
    {
      if (watchFace > -4)
      {
        watchFace--;
        load_screen(watchFace);
      }
      // load_screen(3);
      // sMsg = cMsg;
    }
    else if (screen == ui_aWatch)
    {
    }
    else if (screen == ui_textScreen)
    {
      load_screen(4);
    }
    else if (screen == ui_menuScreen)
    {
      load_screen(watchFace);
    }
    else
    {
      load_screen(1);
    }

    break;
  case LV_DIR_TOP:
    if (screen == ui_watchScreen || screen == ui_gWatch || screen == ui_solarScreen || screen == ui_hWatch || screen == ui_aWatch)
    {
      load_screen(1);
    }

    break;
  case LV_DIR_BOTTOM:
    bgImg = !bgImg;
    if (bgImg)
    {
      lv_img_set_src(ui_backgroundImage, &ui_img_background1_png);
    }
    else
    {
      lv_img_set_src(ui_backgroundImage, &ui_img_background2_png);
    }

    break;
  }
}

void my_input_read(lv_indev_drv_t *drv, lv_indev_data_t *data)
{
  data->point.x = touch_data.xpos;
  data->point.y = touch_data.ypos;

