fbiego/dt78-esp32-firmware/src/main.cpp
  if (touch_data.touchpoints == 1 && touch_data.event == 2)
  {
    if (screenOn)
    {
      data->state = LV_INDEV_STATE_PR;
      // screenOn = true;
      onTime = millis();
      // Serial.println(touch_data.gesture);
    }
    else
    {
      data->state = LV_INDEV_STATE_REL;
    }
  }
  else
  {
    data->state = LV_INDEV_STATE_REL;
  }
  // return false; /*No buffering now so no more data read*/
}

static void scroll_event_cb(lv_event_t *e)
{
  lv_obj_t *ui_menuList = lv_event_get_target(e);

  lv_area_t ui_menuList_a;
  lv_obj_get_coords(ui_menuList, &ui_menuList_a);
  lv_coord_t ui_menuList_y_center = ui_menuList_a.y1 + lv_area_get_height(&ui_menuList_a) / 2;

  lv_coord_t r = lv_obj_get_height(ui_menuList) * 7 / 10;
  uint32_t i;
  uint32_t child_cnt = lv_obj_get_child_cnt(ui_menuList);
  for (i = 0; i < child_cnt; i++)
  {
    lv_obj_t *child = lv_obj_get_child(ui_menuList, i);
    lv_area_t child_a;
    lv_obj_get_coords(child, &child_a);

    lv_coord_t child_y_center = child_a.y1 + lv_area_get_height(&child_a) / 2;

    lv_coord_t diff_y = child_y_center - ui_menuList_y_center;
    diff_y = LV_ABS(diff_y);

    /*Get the x of diff_y on a circle.*/
    lv_coord_t x;
    /*If diff_y is out of the circle use the last point of the circle (the radius)*/
    if (diff_y >= r)
    {
      x = r;
    }
    else
    {
      /*Use Pythagoras theorem to get x from radius and y*/
      uint32_t x_sqr = r * r - diff_y * diff_y;
      lv_sqrt_res_t res;
      lv_sqrt(x_sqr, &res, 0x8000); /*Use lvgl's built in sqrt root function*/
      x = r - res.i;
    }

    /*Translate the item by the calculated X coordinate*/
    lv_obj_set_style_translate_x(child, x, 0);

    /*Use some opacity with larger translations*/
    // lv_opa_t opa = lv_map(x, 0, r, LV_OPA_TRANSP, LV_OPA_COVER);
    // lv_obj_set_style_opa(child, LV_OPA_COVER - opa, 0);
  }
}

void IRAM_ATTR screenInt()
{
  screenOn = true;
  onTime = millis();
}

void accInt()
{
  int v = digitalRead(TINT);
  Serial.print("Touch interrupt with level: ");
  Serial.println(v);
}

void mpuInt()
{
  int v = digitalRead(MPU_INT);
  Serial.print("MPU interrupt with level: ");
  Serial.println(v);
}

void wakeup_reason()
{
  esp_sleep_wakeup_cause_t wakeup_reason;

  wakeup_reason = esp_sleep_get_wakeup_cause();

  switch (wakeup_reason)
  {
  case ESP_SLEEP_WAKEUP_EXT0:
    Serial.println("Wakeup caused by external signal using RTC_IO");
    break;
  case ESP_SLEEP_WAKEUP_EXT1:
    Serial.println("Wakeup caused by external signal using RTC_CNTL");
    break;
  case ESP_SLEEP_WAKEUP_TIMER:
    Serial.println("Wakeup caused by timer");
    break;
  case ESP_SLEEP_WAKEUP_TOUCHPAD:
    Serial.println("Wakeup caused by touchpad");
    break;
  case ESP_SLEEP_WAKEUP_ULP:
    Serial.println("Wakeup caused by ULP program");
    break;
  default:
    Serial.printf("Wakeup was not caused by deep sleep: %d\n", wakeup_reason);
    //rtc.setTime(1655998793); // set the time if not coming from deep sleep ie reset or power up
    break;
  }
}

void deep_sleep()
{

  digitalWrite(MOTOR, HIGH);
  delay(100);
  digitalWrite(MOTOR, LOW);
  ledcWrite(ledChannel, 0);
  sleep_touch(true);
  myIMU.standby(true);
  rtc_gpio_pullup_en(GPIO_NUM_32);

  esp_sleep_enable_ext0_wakeup(GPIO_NUM_32, 0); // 1 = High, 0 = Low

  // Go to sleep now
  Serial.println("Going to deep sleep now");
  esp_deep_sleep_start();
}

void light_sleep()
{

  sleep_touch(true);
  digitalWrite(MOTOR, LOW);
  ledcWrite(ledChannel, 0);
  myIMU.standby(true);
  rtc_gpio_pullup_en(GPIO_NUM_33);

  esp_sleep_enable_ext0_wakeup(GPIO_NUM_33, 0); // 1 = High, 0 = Low

  // Go to sleep now
  Serial.println("Going to light sleep now");
  esp_light_sleep_start();
}

void power_save()
{
  digitalWrite(MOTOR, LOW);
  // ledcWrite(ledChannel, 0);
  // sleep_touch(true);
  myIMU.standby(true);
}

void setup()
{
  // put your setup code here, to run once:

  Serial.begin(115200);

  wakeup_reason();

  gfx->begin();
  gfx->fillScreen(BLACK);

  init_i2c();
  init_touch();
  pinMode(TINT, INPUT);
  // attachInterrupt(TINT, accInt, CHANGE);
  pinMode(MPU_INT, INPUT);
  // attachInterrupt(MPU_INT, mpuInt, CHANGE);

  lv_init();
  init_BLE();

  if (myIMU.begin(sampleRate, accelRange) != 0)
  {
    Serial.print("Failed to initialize IMU.\n");
  }
  else
  {
    Serial.print("IMU initialized.\n");
  }

  myIMU.intConf(123, 1, 10, HIGH);

  // Get the IMU ID:
  myIMU.readRegister(&imuID, KXTJ3_WHO_AM_I);

  screenWidth = gfx->width();
  screenHeight = gfx->height();

  Serial.print("Width: ");
  Serial.print(screenWidth);
  Serial.print("\tHeight: ");
  Serial.println(screenHeight);
  disp_draw_buf = (lv_color_t *)malloc(sizeof(lv_color_t) * screenWidth * 10);
  if (!disp_draw_buf)
  {
    Serial.println("LVGL disp_draw_buf allocate failed!");
  }
  else
  {
    lv_disp_draw_buf_init(&draw_buf, disp_draw_buf, NULL, screenWidth * 10);

    /* Initialize the display */
    lv_disp_drv_init(&disp_drv);
    /* Change the following line to your display resolution */
    disp_drv.hor_res = screenWidth;
    disp_drv.ver_res = screenHeight;
    disp_drv.flush_cb = my_disp_flush;
    disp_drv.draw_buf = &draw_buf;
    lv_disp_drv_register(&disp_drv);

    /* Initialize the input device driver */
    static lv_indev_drv_t indev_drv;
    lv_indev_drv_init(&indev_drv);
    indev_drv.type = LV_INDEV_TYPE_POINTER;
    indev_drv.read_cb = my_input_read;
    lv_indev_drv_register(&indev_drv);

    lv_disp_t *display = lv_disp_get_default();
    lv_theme_t *theme = lv_theme_default_init(display, lv_palette_main(LV_PALETTE_BLUE), lv_palette_main(LV_PALETTE_RED),
                                              true, LV_FONT_DEFAULT);
    lv_disp_set_theme(display, theme);
    ui_watchScreen_screen_init();
    ui_menuScreen_screen_init();
    ui_messageListScreen_screen_init();
    ui_settingsScreen_screen_init();
    ui_textScreen_screen_init();
    ui_aboutScreen_screen_init();
    ui_testScreen_screen_init();
    ui_solarScreen_screen_init();
    ui_aWatch_screen_init();
    ui_gWatch_screen_init();
    ui_hWatch_screen_init();
    load_screen(watchFace);
    // lv_disp_load_scr(ui_watchScreen);

    Serial.println("Setup done");
  }

