fbiego/dt78-esp32-firmware/src/main.cpp
  onTime = millis();
  // pinMode(BL, OUTPUT);
  // digitalWrite(BL, HIGH);
  pinMode(CHARGE, INPUT);
  pinMode(BATT, INPUT);
  pinMode(MOTOR, OUTPUT);
  digitalWrite(MOTOR, HIGH);
  delay(100);
  digitalWrite(MOTOR, LOW);
  pinMode(B0, INPUT_PULLUP);
  attachInterrupt(B0, screenInt, FALLING);

  pinMode(BT1, INPUT_PULLUP);
  attachInterrupt(BT1, checkButton1, CHANGE);
  pinMode(BT2, INPUT_PULLUP);
  attachInterrupt(BT2, checkButton2, CHANGE);

  ledcSetup(ledChannel, freq, resolution);
  // attach the channel to the GPIO to be ui_menuListrolled
  ledcAttachPin(ledPin, ledChannel);
  ledcWrite(ledChannel, 100);
}

void loop()
{
  // put your main code here, to run repeatedly:

  if (screenOn)
  {
    get_read_touch();
    lv_timer_handler(); /* let the GUI do its work */
    delay(5);

    lv_disp_t *display = lv_disp_get_default();
    lv_obj_t *actScr = lv_disp_get_scr_act(display);

    if (actScr == ui_watchScreen)
    {
      String tm = rtc.getTime("%H:%M");
      int hr = rtc.getHour(hr24);
      int mn = rtc.getMinute();

      lv_label_set_text(ui_dateText, rtc.getTime("%d %B").c_str());
      lv_label_set_text(ui_weekdayText, rtc.getTime("%A").c_str());
      lv_label_set_text(ui_textAmPm, rtc.getAmPm(false).c_str());

      lv_img_set_src(ui_hourIcon1, &digits[hr / 10]);
      lv_img_set_src(ui_hourIcon2, &digits[hr % 10]);
      lv_img_set_src(ui_minuteIcon1, &digits[mn / 10]);
      lv_img_set_src(ui_minuteIcon2, &digits[mn % 10]);

      lv_label_set_text(ui_stepsText, String(curSteps).c_str());

      stepsProgress = (curSteps / 5000) * 100;

      lv_arc_set_value(ui_stepsProgress, curSteps);

      if (hr24)
      {
        lv_obj_add_flag(ui_textAmPm, LV_OBJ_FLAG_HIDDEN | LV_OBJ_FLAG_ADV_HITTEST);
      }
      else
      {
        lv_obj_clear_flag(ui_textAmPm, LV_OBJ_FLAG_HIDDEN);
      }

      if (digitalRead(CHARGE))
      {
        lv_obj_add_flag(ui_chargingIcon, LV_OBJ_FLAG_HIDDEN | LV_OBJ_FLAG_ADV_HITTEST);
      }
      else
      {
        lv_obj_clear_flag(ui_chargingIcon, LV_OBJ_FLAG_HIDDEN);
      }
      if (!deviceConnected)
      {
        lv_obj_add_flag(ui_bluetoothIcon, LV_OBJ_FLAG_HIDDEN | LV_OBJ_FLAG_ADV_HITTEST);
      }
      else
      {
        lv_obj_clear_flag(ui_bluetoothIcon, LV_OBJ_FLAG_HIDDEN);
      }
    }
    else if (actScr == ui_gWatch)
    {
      lv_label_set_text(ui_gDateText, rtc.getTime("%A %d %B").c_str());
      lv_label_set_text(ui_gHourText, rtc.getTime("%H").c_str());
      lv_label_set_text(ui_gMinuteText, rtc.getTime("%M").c_str());
    }
    else if (actScr == ui_hWatch)
    {
      lv_label_set_text(ui_hTineText, rtc.getTime().c_str());
      lv_label_set_text(ui_hDayText, rtc.getTime("%A").c_str());
      lv_label_set_text(ui_hDateText, rtc.getTime("%d-%m-%Y").c_str());
      lv_label_set_text(ui_hEpochText, String(rtc.getEpoch()).c_str());
    }
    else if (actScr == ui_aWatch)
    {
      String wkdy = rtc.getTime("%a");
      wkdy.toUpperCase();
      lv_label_set_text(ui_aDayText, rtc.getTime("%d").c_str());
      lv_label_set_text(ui_aWeekText, wkdy.c_str());

      lv_meter_set_indicator_value(ui_aClock, aHour, (rtc.getHour() * 5.0 + rtc.getMinute() / 12.0) * 10.0);
      lv_meter_set_indicator_value(ui_aClock, aMinute, rtc.getMinute() * 10.0);
      lv_meter_set_indicator_value(ui_aClock, aSecond, (rtc.getSecond() + rtc.getMillis() / 1000.0) * 10.0);
    }
    else if (actScr == ui_solarScreen)
    {
      lv_meter_set_indicator_value(ui_sClock, sHour, (rtc.getHour() * 5.0 + rtc.getMinute() / 12.0) * 10.0);
      lv_meter_set_indicator_value(ui_sClock, sMinute, rtc.getMinute() * 10.0);
      lv_meter_set_indicator_value(ui_sClock, sSecond, (rtc.getSecond() + rtc.getMillis() / 1000.0) * 10.0);
    }
    else if (actScr == ui_testScreen)
    {
      get_IMU();

      digitalWrite(MOTOR, motor);

      lv_bar_set_value(ui_accXBar, map((accX * 100), -100, 100, 0, 100), LV_ANIM_ON);
      lv_bar_set_value(ui_accYBar, map((accY * 100), -100, 100, 0, 100), LV_ANIM_ON);
      lv_bar_set_value(ui_accZBar, map((accZ * 100), -100, 100, 0, 100), LV_ANIM_ON);
    }
    else if (actScr == ui_settingsScreen)
    {
      bool sw = lv_obj_has_state(ui_autoScreenSwitch, LV_STATE_CHECKED);
      if (sw != autoScreen)
      {
        if (autoScreen)
        {
          lv_obj_add_state(ui_autoScreenSwitch, LV_STATE_CHECKED);
        }
        else
        {
          lv_obj_clear_state(ui_autoScreenSwitch, LV_STATE_CHECKED);
        }
      }
    }
  }

  // vector = sqrt((accX * accX) + (accY * accY) + (accZ * accZ));

  // samples[x] = vector;
  // x++;
  // if (x >= SAMPLES)
  // {
  //   x = 0;
  //   int st = calculate_steps();
  //   // lv_label_set_text(ui_Label9, String(st).c_str());
  //   curSteps += st;
  // }

  if (isNotify)
  {
    isNotify = false;
    digitalWrite(MOTOR, HIGH);
    delay(notifyTime);
    digitalWrite(MOTOR, LOW);
  }

  if (accX > 0.3 && accX < 1.0 && accY > -0.3 && accY < 0.3 && accZ > -1.0 && accZ < -0.7)
  {
    if (autoScreen)
    {
      screenOn = true;
    }
  }

  if (screenOn)
  {
    // digitalWrite(BL, HIGH);
    ledcWrite(ledChannel, brightness + 1);
    String chrg = digitalRead(CHARGE) ? "" : "Charging";
    // String per = String(getBattery()) + "mV";
    if ((onTime + 10000) < millis())
    {

      screenOn = false;
      ledcWrite(ledChannel, 0);
      load_screen(watchFace); // back to watchScreen
      light_sleep();
    }
  }
  else
  {
  }
}

void load_screen(int screen)
{
  switch (screen)
  {
  case -4:
    lv_disp_load_scr(ui_aWatch);
    break;
  case -3:
    lv_disp_load_scr(ui_gWatch);
    break;
  case -2:
    lv_disp_load_scr(ui_hWatch);
    break;
  case -1:
    lv_disp_load_scr(ui_solarScreen);
    break;
  case 0:
    lv_disp_load_scr(ui_watchScreen);
    break;
  case 1:
    lv_disp_load_scr(ui_menuScreen);
    break;
  case 2:
    lv_disp_load_scr(ui_settingsScreen);
    break;
  case 3:
    lv_disp_load_scr(ui_textScreen);
    break;
  case 4:
    reload_message_list();
    lv_disp_load_scr(ui_messageListScreen);
    break;
  case 5:
    lv_disp_load_scr(ui_aboutScreen);
    break;
  case 6:
    lv_disp_load_scr(ui_testScreen);
    break;
  }
}

