fbiego/dt78-esp32-firmware/src/main.cpp
void reload_message_list()
{
  lv_obj_clean(ui_messageList);

  if (cMsg < 0)
  {
    lv_obj_t *msgSelect = lv_list_add_btn(ui_messageList, &ui_img_message_png, "No messages");
    set_style(msgSelect);
  }

  for (int i = cMsg; i >= 0 && i > (cMsg - 5); i--)
  {
    lv_obj_t *msgSelect = lv_list_add_btn(ui_messageList, &ui_img_comment_png, title[i % 5].c_str());
    lv_obj_add_event_cb(msgSelect, event_handler, LV_EVENT_CLICKED, NULL);
    set_style(msgSelect);
  }
}

void get_IMU()
{
  myIMU.standby(false);
  /*
    int16_t dataHighres = 0;

    if ( myIMU.readRegisterInt16( &dataHighres, KXTJ3_OUT_X_L ) != 0 ) {

      Serial.print("X: ");
      Serial.print(dataHighres);
    }

    if ( myIMU.readRegisterInt16( &dataHighres, KXTJ3_OUT_Y_L ) != 0 ) {

      Serial.print("\tY: ");
      Serial.print(dataHighres);
    }

    if ( myIMU.readRegisterInt16( &dataHighres, KXTJ3_OUT_Z_L ) != 0 ) {

      Serial.print("\tZ: ");
      Serial.println(dataHighres);
    }

  */

  accX = myIMU.axisAccel(X);
  accY = myIMU.axisAccel(Y);
  accZ = myIMU.axisAccel(Z);

  myIMU.standby(true);
}

int calculate_steps()
{
  float high = samples[0];
  float low = samples[0];
  for (int x = 0; x < SAMPLES; x++)
  {
    if (samples[x] < low)
    {
      low = samples[x];
    }
    if (samples[x] > high)
    {
      high = samples[x];
    }
  }
  float mid = (high + low) / 2;
  float thresh = (high - low) / 4;
  int h = 0, l = 0;
  int flag = 0;
  for (int x = 0; x < SAMPLES; x++)
  {
    if (samples[x] < (mid - thresh) && thresh > 0.1)
    {
      if (flag == 0 || flag == 1)
      {
        l++;
        flag = 2;
      }
    }
    else
    {
      flag = 0;
    }
    if (samples[x] > (mid + thresh) && thresh > 0.1)
    {
      if (flag == 0 || flag == 2)
      {
        h++;
        flag = 1;
      }
    }
    else
    {
      flag = 0;
    }
  }

  if (h < l)
  {
    return h;
  }
  else
  {
    return l;
  }
}

void set_style(lv_obj_t *button)
{

  lv_obj_set_style_pad_top(button, 10, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_pad_bottom(button, 10, LV_PART_MAIN | LV_STATE_DEFAULT);

  lv_obj_set_style_bg_color(button, lv_color_hex(0x000000), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_border_width(button, 1, LV_PART_MAIN | LV_STATE_DEFAULT);
}

///////////////////// SCREENS ////////////////////

void ui_textScreen_screen_init(void)
{

  // ui_textScreen

  ui_textScreen = lv_obj_create(NULL);

  lv_obj_clear_flag(ui_textScreen, LV_OBJ_FLAG_SCROLLABLE);

  lv_obj_set_style_bg_color(ui_textScreen, lv_color_hex(0x000000), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_bg_opa(ui_textScreen, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  lv_obj_add_event_cb(ui_textScreen, my_gesture, LV_EVENT_GESTURE, NULL);

  // ui_textScroll

  ui_textScroll = lv_obj_create(ui_textScreen);

  lv_obj_set_width(ui_textScroll, 240);
  lv_obj_set_height(ui_textScroll, 210);

  lv_obj_set_x(ui_textScroll, 0);
  lv_obj_set_y(ui_textScroll, -15);

  lv_obj_set_align(ui_textScroll, LV_ALIGN_CENTER);

  lv_obj_set_scrollbar_mode(ui_textScroll, LV_SCROLLBAR_MODE_OFF);
  lv_obj_set_scroll_dir(ui_textScroll, LV_DIR_VER);

  lv_obj_set_style_bg_color(ui_textScroll, lv_color_hex(0x000000), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_bg_opa(ui_textScroll, 255, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_border_color(ui_textScroll, lv_color_hex(0x000000), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_border_opa(ui_textScroll, 255, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_border_width(ui_textScroll, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_outline_color(ui_textScroll, lv_color_hex(0x000000), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_outline_opa(ui_textScroll, 255, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_outline_width(ui_textScroll, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_outline_pad(ui_textScroll, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_pad_left(ui_textScroll, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_pad_right(ui_textScroll, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_pad_top(ui_textScroll, 50, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_pad_bottom(ui_textScroll, 0, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_textIcon

  ui_textIcon = lv_img_create(ui_textScroll);
  lv_img_set_src(ui_textIcon, &ui_img_comment_png);

  lv_obj_set_width(ui_textIcon, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_textIcon, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_textIcon, 0);
  lv_obj_set_y(ui_textIcon, -98);

  lv_obj_set_align(ui_textIcon, LV_ALIGN_CENTER);

  lv_obj_add_flag(ui_textIcon, LV_OBJ_FLAG_ADV_HITTEST);
  lv_obj_clear_flag(ui_textIcon, LV_OBJ_FLAG_SCROLLABLE);

  // ui_textTitle

  ui_textTitle = lv_label_create(ui_textScroll);

  lv_obj_set_width(ui_textTitle, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_textTitle, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_textTitle, 0);
  lv_obj_set_y(ui_textTitle, -71);

  lv_obj_set_align(ui_textTitle, LV_ALIGN_CENTER);

  lv_label_set_long_mode(ui_textTitle, LV_LABEL_LONG_SCROLL_CIRCULAR);
  lv_label_set_text(ui_textTitle, "John Doe");

  lv_obj_set_style_text_font(ui_textTitle, &lv_font_montserrat_18, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_textMessage

  ui_textMessage = lv_label_create(ui_textScroll);

  lv_obj_set_width(ui_textMessage, 180);
  lv_obj_set_height(ui_textMessage, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_textMessage, 0);
  lv_obj_set_y(ui_textMessage, 40);

  lv_obj_set_align(ui_textMessage, LV_ALIGN_TOP_MID);

  lv_label_set_text(ui_textMessage,
                    "Lorem ipsum dolor sit amet\n, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. ");

  lv_obj_set_style_pad_left(ui_textMessage, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_pad_right(ui_textMessage, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_pad_top(ui_textMessage, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_pad_bottom(ui_textMessage, 50, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_textTime

  ui_textTime = lv_label_create(ui_textScreen);

  lv_obj_set_width(ui_textTime, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_textTime, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_textTime, -5);
  lv_obj_set_y(ui_textTime, 103);

  lv_obj_set_align(ui_textTime, LV_ALIGN_CENTER);

  lv_label_set_text(ui_textTime, "10:45");
}

void ui_watchScreen_screen_init(void)
{

