fbiego/dt78-esp32-firmware/src/main.cpp
  // ui_watchScreen

  ui_watchScreen = lv_obj_create(NULL);

  lv_obj_clear_flag(ui_watchScreen, LV_OBJ_FLAG_SCROLLABLE);

  lv_obj_set_style_bg_color(ui_watchScreen, lv_color_hex(0x000000), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_bg_opa(ui_watchScreen, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  lv_obj_add_event_cb(ui_watchScreen, my_gesture, LV_EVENT_GESTURE, NULL);

  // ui_backgroundImage

  ui_backgroundImage = lv_img_create(ui_watchScreen);
  lv_img_set_src(ui_backgroundImage, &ui_img_background1_png);

  lv_obj_set_width(ui_backgroundImage, 240);
  lv_obj_set_height(ui_backgroundImage, 240);

  lv_obj_set_x(ui_backgroundImage, 0);
  lv_obj_set_y(ui_backgroundImage, 0);

  lv_obj_set_align(ui_backgroundImage, LV_ALIGN_CENTER);

  lv_obj_add_flag(ui_backgroundImage, LV_OBJ_FLAG_ADV_HITTEST);
  lv_obj_clear_flag(ui_backgroundImage, LV_OBJ_FLAG_SCROLLABLE);

  lv_obj_set_style_img_recolor(ui_backgroundImage, lv_color_hex(0x19174A), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_img_recolor_opa(ui_backgroundImage, 200, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_stepsProgress

  ui_stepsProgress = lv_arc_create(ui_watchScreen);

  lv_obj_set_width(ui_stepsProgress, 240);
  lv_obj_set_height(ui_stepsProgress, 240);

  lv_obj_set_x(ui_stepsProgress, 0);
  lv_obj_set_y(ui_stepsProgress, 0);

  lv_obj_set_align(ui_stepsProgress, LV_ALIGN_CENTER);

  lv_obj_clear_flag(ui_stepsProgress, LV_OBJ_FLAG_CLICKABLE | LV_OBJ_FLAG_SCROLLABLE);

  lv_arc_set_range(ui_stepsProgress, 0, 100);
  lv_arc_set_value(ui_stepsProgress, 21);
  lv_arc_set_bg_angles(ui_stepsProgress, 120, 60);

  lv_obj_set_style_arc_color(ui_stepsProgress, lv_color_hex(0x4040FF), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_arc_opa(ui_stepsProgress, 50, LV_PART_MAIN | LV_STATE_DEFAULT);

  lv_obj_set_style_bg_color(ui_stepsProgress, lv_color_hex(0x39FA68), LV_PART_KNOB | LV_STATE_DEFAULT);
  lv_obj_set_style_bg_opa(ui_stepsProgress, 0, LV_PART_KNOB | LV_STATE_DEFAULT);
  lv_obj_set_style_bg_grad_color(ui_stepsProgress, lv_color_hex(0x39FA68), LV_PART_KNOB | LV_STATE_DEFAULT);

  // ui_weekdayText

  ui_weekdayText = lv_label_create(ui_watchScreen);

  lv_obj_set_width(ui_weekdayText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_weekdayText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_weekdayText, -1);
  lv_obj_set_y(ui_weekdayText, -50);

  lv_obj_set_align(ui_weekdayText, LV_ALIGN_CENTER);

  lv_label_set_text(ui_weekdayText, "Sunday");

  lv_obj_set_style_text_color(ui_weekdayText, lv_color_hex(0xFFFFFF), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_opa(ui_weekdayText, 255, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_font(ui_weekdayText, &lv_font_montserrat_24, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_dateText

  ui_dateText = lv_label_create(ui_watchScreen);

  lv_obj_set_width(ui_dateText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_dateText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_dateText, 0);
  lv_obj_set_y(ui_dateText, 50);

  lv_obj_set_align(ui_dateText, LV_ALIGN_CENTER);

  lv_label_set_text(ui_dateText, "10 July");

  lv_obj_set_style_text_color(ui_dateText, lv_color_hex(0x2095F6), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_opa(ui_dateText, 255, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_font(ui_dateText, &lv_font_montserrat_18, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_hourIcon1

  ui_hourIcon1 = lv_img_create(ui_watchScreen);
  lv_img_set_src(ui_hourIcon1, &ui_img_zero_64_png);

  lv_obj_set_width(ui_hourIcon1, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_hourIcon1, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_hourIcon1, -70);
  lv_obj_set_y(ui_hourIcon1, 1);

  lv_obj_set_align(ui_hourIcon1, LV_ALIGN_CENTER);

  lv_obj_add_flag(ui_hourIcon1, LV_OBJ_FLAG_ADV_HITTEST);
  lv_obj_clear_flag(ui_hourIcon1, LV_OBJ_FLAG_SCROLLABLE);

  lv_obj_set_style_img_recolor(ui_hourIcon1, lv_color_hex(0x2095F6), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_img_recolor_opa(ui_hourIcon1, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_hourIcon2

  ui_hourIcon2 = lv_img_create(ui_watchScreen);
  lv_img_set_src(ui_hourIcon2, &ui_img_five_64_png);

  lv_obj_set_width(ui_hourIcon2, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_hourIcon2, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_hourIcon2, -30);
  lv_obj_set_y(ui_hourIcon2, 0);

  lv_obj_set_align(ui_hourIcon2, LV_ALIGN_CENTER);

  lv_obj_add_flag(ui_hourIcon2, LV_OBJ_FLAG_ADV_HITTEST);
  lv_obj_clear_flag(ui_hourIcon2, LV_OBJ_FLAG_SCROLLABLE);

  lv_obj_set_style_img_recolor(ui_hourIcon2, lv_color_hex(0x2095F6), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_img_recolor_opa(ui_hourIcon2, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_minuteIcon1

  ui_minuteIcon1 = lv_img_create(ui_watchScreen);
  lv_img_set_src(ui_minuteIcon1, &ui_img_one_64_png);

  lv_obj_set_width(ui_minuteIcon1, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_minuteIcon1, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_minuteIcon1, 30);
  lv_obj_set_y(ui_minuteIcon1, 0);

  lv_obj_set_align(ui_minuteIcon1, LV_ALIGN_CENTER);

  lv_obj_add_flag(ui_minuteIcon1, LV_OBJ_FLAG_ADV_HITTEST);
  lv_obj_clear_flag(ui_minuteIcon1, LV_OBJ_FLAG_SCROLLABLE);

  lv_obj_set_style_img_recolor(ui_minuteIcon1, lv_color_hex(0x2095F6), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_img_recolor_opa(ui_minuteIcon1, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_minuteIcon2

  ui_minuteIcon2 = lv_img_create(ui_watchScreen);
  lv_img_set_src(ui_minuteIcon2, &ui_img_nine_64_png);

  lv_obj_set_width(ui_minuteIcon2, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_minuteIcon2, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_minuteIcon2, 70);
  lv_obj_set_y(ui_minuteIcon2, 0);

  lv_obj_set_align(ui_minuteIcon2, LV_ALIGN_CENTER);

  lv_obj_add_flag(ui_minuteIcon2, LV_OBJ_FLAG_ADV_HITTEST);
  lv_obj_clear_flag(ui_minuteIcon2, LV_OBJ_FLAG_SCROLLABLE);

  lv_obj_set_style_img_recolor(ui_minuteIcon2, lv_color_hex(0x2095F6), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_img_recolor_opa(ui_minuteIcon2, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_timeSeparator

