fbiego/dt78-esp32-firmware/src/main.cpp
  ui_timeSeparator = lv_label_create(ui_watchScreen);

  lv_obj_set_width(ui_timeSeparator, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_timeSeparator, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_timeSeparator, 0);
  lv_obj_set_y(ui_timeSeparator, 0);

  lv_obj_set_align(ui_timeSeparator, LV_ALIGN_CENTER);

  lv_label_set_text(ui_timeSeparator, ":");

  lv_obj_set_style_text_color(ui_timeSeparator, lv_color_hex(0x2095F6), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_opa(ui_timeSeparator, 255, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_font(ui_timeSeparator, &lv_font_montserrat_48, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_textAmPm

  ui_textAmPm = lv_label_create(ui_watchScreen);

  lv_obj_set_width(ui_textAmPm, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_textAmPm, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_textAmPm, 67);
  lv_obj_set_y(ui_textAmPm, 39);

  lv_obj_set_align(ui_textAmPm, LV_ALIGN_CENTER);

  lv_label_set_text(ui_textAmPm, "AM");

  // ui_stepsIcon

  ui_stepsIcon = lv_img_create(ui_watchScreen);
  lv_img_set_src(ui_stepsIcon, &ui_img_steps_png);

  lv_obj_set_width(ui_stepsIcon, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_stepsIcon, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_stepsIcon, -25);
  lv_obj_set_y(ui_stepsIcon, 100);

  lv_obj_set_align(ui_stepsIcon, LV_ALIGN_CENTER);

  lv_obj_add_flag(ui_stepsIcon, LV_OBJ_FLAG_ADV_HITTEST);
  lv_obj_clear_flag(ui_stepsIcon, LV_OBJ_FLAG_SCROLLABLE);

  // ui_stepsText

  ui_stepsText = lv_label_create(ui_watchScreen);

  lv_obj_set_width(ui_stepsText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_stepsText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_stepsText, 110);
  lv_obj_set_y(ui_stepsText, 102);

  lv_obj_set_align(ui_stepsText, LV_ALIGN_LEFT_MID);

  lv_label_set_text(ui_stepsText, "1024");

  lv_obj_set_style_text_align(ui_stepsText, LV_TEXT_ALIGN_RIGHT, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_font(ui_stepsText, &lv_font_montserrat_18, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_bluetoothIcon

  ui_bluetoothIcon = lv_img_create(ui_watchScreen);
  lv_img_set_src(ui_bluetoothIcon, &ui_img_bluetooth_png);

  lv_obj_set_width(ui_bluetoothIcon, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_bluetoothIcon, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_bluetoothIcon, 50);
  lv_obj_set_y(ui_bluetoothIcon, 75);

  lv_obj_set_align(ui_bluetoothIcon, LV_ALIGN_CENTER);

  lv_obj_add_flag(ui_bluetoothIcon, LV_OBJ_FLAG_ADV_HITTEST);
  lv_obj_clear_flag(ui_bluetoothIcon, LV_OBJ_FLAG_SCROLLABLE);

  // ui_chargingIcon

  ui_chargingIcon = lv_img_create(ui_watchScreen);
  lv_img_set_src(ui_chargingIcon, &ui_img_energy_png);

  lv_obj_set_width(ui_chargingIcon, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_chargingIcon, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_chargingIcon, -50);
  lv_obj_set_y(ui_chargingIcon, 75);

  lv_obj_set_align(ui_chargingIcon, LV_ALIGN_CENTER);

  lv_obj_add_flag(ui_chargingIcon, LV_OBJ_FLAG_HIDDEN | LV_OBJ_FLAG_ADV_HITTEST);
  lv_obj_clear_flag(ui_chargingIcon, LV_OBJ_FLAG_SCROLLABLE);
}

void ui_settingsScreen_screen_init(void)
{

  // ui_settingsScreen

  ui_settingsScreen = lv_obj_create(NULL);

  lv_obj_clear_flag(ui_settingsScreen, LV_OBJ_FLAG_PRESS_LOCK | LV_OBJ_FLAG_SCROLLABLE);

  lv_obj_set_style_bg_color(ui_settingsScreen, lv_color_hex(0x000000), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_bg_opa(ui_settingsScreen, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  lv_obj_add_event_cb(ui_settingsScreen, my_gesture, LV_EVENT_GESTURE, NULL);

  // ui_scrollSettings

  ui_scrollSettings = lv_obj_create(ui_settingsScreen);

  lv_obj_set_width(ui_scrollSettings, 240);
  lv_obj_set_height(ui_scrollSettings, 240);

  lv_obj_set_x(ui_scrollSettings, 0);
  lv_obj_set_y(ui_scrollSettings, 0);

  lv_obj_set_align(ui_scrollSettings, LV_ALIGN_CENTER);

  lv_obj_set_scrollbar_mode(ui_scrollSettings, LV_SCROLLBAR_MODE_OFF);

  lv_obj_set_style_bg_color(ui_scrollSettings, lv_color_hex(0x000000), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_bg_opa(ui_scrollSettings, 255, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_border_width(ui_scrollSettings, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_pad_left(ui_scrollSettings, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_pad_right(ui_scrollSettings, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_pad_top(ui_scrollSettings, 100, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_pad_bottom(ui_scrollSettings, 70, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_bluetoothText

  ui_bluetoothText = lv_label_create(ui_scrollSettings);

  lv_obj_set_width(ui_bluetoothText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_bluetoothText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_bluetoothText, -41);
  lv_obj_set_y(ui_bluetoothText, -75);

  lv_obj_set_align(ui_bluetoothText, LV_ALIGN_CENTER);

  lv_label_set_text(ui_bluetoothText, "Bluetooth");

  lv_obj_set_style_pad_left(ui_bluetoothText, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_pad_right(ui_bluetoothText, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_pad_top(ui_bluetoothText, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_pad_bottom(ui_bluetoothText, 0, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_bluetoothSwitch

  ui_bluetoothSwitch = lv_switch_create(ui_scrollSettings);

  lv_obj_set_width(ui_bluetoothSwitch, 50);
  lv_obj_set_height(ui_bluetoothSwitch, 25);

  lv_obj_set_x(ui_bluetoothSwitch, 43);
  lv_obj_set_y(ui_bluetoothSwitch, -75);

  lv_obj_set_align(ui_bluetoothSwitch, LV_ALIGN_CENTER);

  lv_obj_add_state(ui_bluetoothSwitch, LV_STATE_CHECKED);

  lv_obj_add_event_cb(ui_bluetoothSwitch, switch_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

  // ui_brightnessText

  ui_brightnessText = lv_label_create(ui_scrollSettings);

  lv_obj_set_width(ui_brightnessText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_brightnessText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_brightnessText, -38);
  lv_obj_set_y(ui_brightnessText, -50);

  lv_obj_set_align(ui_brightnessText, LV_ALIGN_CENTER);

  lv_label_set_text(ui_brightnessText, "Brightness");

  // ui_brightnessSlider

  ui_brightnessSlider = lv_slider_create(ui_scrollSettings);
  lv_slider_set_range(ui_brightnessSlider, 0, 255);
  lv_slider_set_value(ui_brightnessSlider, 100, LV_ANIM_OFF);
  if (lv_slider_get_mode(ui_brightnessSlider) == LV_SLIDER_MODE_RANGE)
    lv_slider_set_left_value(ui_brightnessSlider, 10,
                             LV_ANIM_OFF);

