fbiego/dt78-esp32-firmware/src/main.cpp
  lv_obj_set_width(ui_brightnessSlider, 150);
  lv_obj_set_height(ui_brightnessSlider, 10);

  lv_obj_set_x(ui_brightnessSlider, 0);
  lv_obj_set_y(ui_brightnessSlider, -30);

  lv_obj_set_align(ui_brightnessSlider, LV_ALIGN_CENTER);

  lv_obj_clear_flag(ui_brightnessSlider, LV_OBJ_FLAG_GESTURE_BUBBLE);

  lv_obj_add_event_cb(ui_brightnessSlider, slider_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

  // ui_autoScreenText

  ui_autoScreenText = lv_label_create(ui_scrollSettings);

  lv_obj_set_width(ui_autoScreenText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_autoScreenText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_autoScreenText, -45);
  lv_obj_set_y(ui_autoScreenText, 0);

  lv_obj_set_align(ui_autoScreenText, LV_ALIGN_CENTER);

  lv_label_set_text(ui_autoScreenText, "Raise to wake");

  // ui_autoScreenSwitch

  ui_autoScreenSwitch = lv_switch_create(ui_scrollSettings);

  lv_obj_set_width(ui_autoScreenSwitch, 50);
  lv_obj_set_height(ui_autoScreenSwitch, 25);

  lv_obj_set_x(ui_autoScreenSwitch, 45);
  lv_obj_set_y(ui_autoScreenSwitch, 0);

  lv_obj_set_align(ui_autoScreenSwitch, LV_ALIGN_CENTER);

  lv_obj_add_event_cb(ui_autoScreenSwitch, switch_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

  // ui_themeText

  ui_themeText = lv_label_create(ui_scrollSettings);

  lv_obj_set_width(ui_themeText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_themeText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_themeText, 0);
  lv_obj_set_y(ui_themeText, 30);

  lv_obj_set_align(ui_themeText, LV_ALIGN_CENTER);

  lv_label_set_text(ui_themeText, "ThemeColor");

  // ui_colorWheel

  ui_colorWheel = lv_colorwheel_create(ui_scrollSettings, true);

  lv_obj_set_width(ui_colorWheel, 100);
  lv_obj_set_height(ui_colorWheel, 100);

  lv_obj_set_x(ui_colorWheel, 0);
  lv_obj_set_y(ui_colorWheel, 80);

  lv_obj_set_align(ui_colorWheel, LV_ALIGN_TOP_MID);

  lv_obj_clear_flag(ui_colorWheel, LV_OBJ_FLAG_GESTURE_BUBBLE);

  lv_obj_add_event_cb(ui_colorWheel, theme_change, LV_EVENT_VALUE_CHANGED, NULL);

  // ui_powerText

  ui_powerText = lv_label_create(ui_scrollSettings);

  lv_obj_set_width(ui_powerText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_powerText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_powerText, 0);
  lv_obj_set_y(ui_powerText, 170);

  lv_obj_set_align(ui_powerText, LV_ALIGN_CENTER);

  lv_label_set_text(ui_powerText, "Slide to power off");

  // ui_powerSlider

  ui_powerSlider = lv_slider_create(ui_scrollSettings);
  lv_slider_set_range(ui_powerSlider, 0, 100);

  lv_obj_set_width(ui_powerSlider, 150);
  lv_obj_set_height(ui_powerSlider, 25);

  lv_obj_set_x(ui_powerSlider, 6);
  lv_obj_set_y(ui_powerSlider, 200);

  lv_obj_set_align(ui_powerSlider, LV_ALIGN_CENTER);
  lv_obj_add_flag(ui_powerSlider, LV_OBJ_FLAG_ADV_HITTEST);

  lv_obj_clear_flag(ui_powerSlider, LV_OBJ_FLAG_GESTURE_BUBBLE);

  lv_obj_add_event_cb(ui_powerSlider, slider_event_cb, LV_EVENT_ALL, NULL);
}

void ui_menuScreen_screen_init(void)
{

  // ui_menuScreen

  ui_menuScreen = lv_obj_create(NULL);

  lv_obj_set_style_bg_color(ui_menuScreen, lv_color_hex(0x000000), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_bg_opa(ui_menuScreen, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  lv_obj_add_event_cb(ui_menuScreen, my_gesture, LV_EVENT_GESTURE, NULL);

  ui_menuList = lv_obj_create(ui_menuScreen);
  lv_obj_set_size(ui_menuList, 240, 240);
  lv_obj_center(ui_menuList);
  lv_obj_set_flex_flow(ui_menuList, LV_FLEX_FLOW_COLUMN);
  lv_obj_add_event_cb(ui_menuList, scroll_event_cb, LV_EVENT_SCROLL, NULL);
  lv_obj_set_style_radius(ui_menuList, LV_RADIUS_CIRCLE, 0);
  lv_obj_set_style_clip_corner(ui_menuList, true, 0);
  lv_obj_set_scroll_dir(ui_menuList, LV_DIR_VER);
  // lv_obj_set_scroll_snap_y(ui_menuList, LV_SCROLL_SNAP_CENTER);
  lv_obj_set_scrollbar_mode(ui_menuList, LV_SCROLLBAR_MODE_OFF);
  lv_obj_set_style_bg_color(ui_menuList, lv_color_hex(0x000000), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_border_width(ui_menuList, 0, LV_PART_MAIN | LV_STATE_DEFAULT);

  lv_obj_set_style_pad_top(ui_menuList, 50, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_pad_bottom(ui_menuList, 50, LV_PART_MAIN | LV_STATE_DEFAULT);

  ui_buttonMessages = lv_list_add_btn(ui_menuList, &ui_img_message_png, "Messages");
  lv_obj_add_event_cb(ui_buttonMessages, event_handler, LV_EVENT_CLICKED, NULL);
  set_style(ui_buttonMessages);

  ui_buttonFitness = lv_list_add_btn(ui_menuList, &ui_img_fitness_png, "Fitness");
  lv_obj_add_event_cb(ui_buttonFitness, event_handler, LV_EVENT_CLICKED, NULL);
  set_style(ui_buttonFitness);

  ui_buttonHealth = lv_list_add_btn(ui_menuList, &ui_img_heart_png, "Health");
  lv_obj_add_event_cb(ui_buttonHealth, event_handler, LV_EVENT_CLICKED, NULL);
  set_style(ui_buttonHealth);

  ui_buttonWeather = lv_list_add_btn(ui_menuList, &ui_img_weather_png, "Weather");
  lv_obj_add_event_cb(ui_buttonWeather, event_handler, LV_EVENT_CLICKED, NULL);
  set_style(ui_buttonWeather);

  ui_buttonMusic = lv_list_add_btn(ui_menuList, &ui_img_music_png, "Music");
  lv_obj_add_event_cb(ui_buttonMusic, event_handler, LV_EVENT_CLICKED, NULL);
  set_style(ui_buttonMusic);

  ui_buttonStopwatch = lv_list_add_btn(ui_menuList, &ui_img_stopwatch_png, "Stopwatch");
  lv_obj_add_event_cb(ui_buttonStopwatch, event_handler, LV_EVENT_CLICKED, NULL);
  set_style(ui_buttonStopwatch);

  ui_buttonTimer = lv_list_add_btn(ui_menuList, &ui_img_timer_png, "Timer");
  lv_obj_add_event_cb(ui_buttonTimer, event_handler, LV_EVENT_CLICKED, NULL);
  set_style(ui_buttonTimer);

  ui_buttonFind = lv_list_add_btn(ui_menuList, &ui_img_search_png, "Tests");
  lv_obj_add_event_cb(ui_buttonFind, event_handler, LV_EVENT_CLICKED, NULL);
  set_style(ui_buttonFind);

  ui_buttonSettings = lv_list_add_btn(ui_menuList, &ui_img_setting_png, "Settings");
  lv_obj_add_event_cb(ui_buttonSettings, event_handler, LV_EVENT_CLICKED, NULL);
  set_style(ui_buttonSettings);

  ui_buttonAbout = lv_list_add_btn(ui_menuList, &ui_img_about_png, "About");
  lv_obj_add_event_cb(ui_buttonAbout, event_handler, LV_EVENT_CLICKED, NULL);
  set_style(ui_buttonAbout);

  /*Update the buttons position manually for first*/
  lv_event_send(ui_menuList, LV_EVENT_SCROLL, NULL);

