fbiego/dt78-esp32-firmware/src/main.cpp
  /*Be sure the fist button is in the middle*/
  lv_obj_scroll_to_view(lv_obj_get_child(ui_menuList, 0), LV_ANIM_ON);
}

void ui_messageListScreen_screen_init(void)
{

  // ui_messageListScreen

  ui_messageListScreen = lv_obj_create(NULL);

  lv_obj_set_style_bg_color(ui_messageListScreen, lv_color_hex(0x000000), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_bg_opa(ui_messageListScreen, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  lv_obj_add_event_cb(ui_messageListScreen, my_gesture, LV_EVENT_GESTURE, NULL);

  ui_messageList = lv_obj_create(ui_messageListScreen);
  lv_obj_set_size(ui_messageList, 240, 240);
  lv_obj_center(ui_messageList);
  lv_obj_set_flex_flow(ui_messageList, LV_FLEX_FLOW_COLUMN);
  lv_obj_add_event_cb(ui_messageList, scroll_event_cb, LV_EVENT_SCROLL, NULL);
  lv_obj_set_style_radius(ui_messageList, LV_RADIUS_CIRCLE, 0);
  lv_obj_set_style_clip_corner(ui_messageList, true, 0);
  lv_obj_set_scroll_dir(ui_messageList, LV_DIR_VER);
  lv_obj_set_scroll_snap_y(ui_messageList, LV_SCROLL_SNAP_CENTER);
  lv_obj_set_scrollbar_mode(ui_messageList, LV_SCROLLBAR_MODE_OFF);
  lv_obj_set_style_bg_color(ui_messageList, lv_color_hex(0x000000), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_border_width(ui_messageList, 0, LV_PART_MAIN | LV_STATE_DEFAULT);

  lv_obj_set_style_pad_top(ui_messageList, 50, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_pad_bottom(ui_messageList, 50, LV_PART_MAIN | LV_STATE_DEFAULT);
}

void ui_testScreen_screen_init(void)
{

  // ui_testScreen

  ui_testScreen = lv_obj_create(NULL);

  lv_obj_clear_flag(ui_testScreen, LV_OBJ_FLAG_SCROLLABLE);

  lv_obj_set_style_bg_color(ui_testScreen, lv_color_hex(0x000000), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_bg_opa(ui_testScreen, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  lv_obj_add_event_cb(ui_testScreen, my_gesture, LV_EVENT_GESTURE, NULL);

  // ui_buttonUp

  ui_buttonUp = lv_arc_create(ui_testScreen);

  lv_obj_set_width(ui_buttonUp, 240);
  lv_obj_set_height(ui_buttonUp, 240);

  lv_obj_set_x(ui_buttonUp, 0);
  lv_obj_set_y(ui_buttonUp, 0);

  lv_obj_set_align(ui_buttonUp, LV_ALIGN_CENTER);

  lv_arc_set_range(ui_buttonUp, 0, 1);
  lv_arc_set_value(ui_buttonUp, 0);
  lv_arc_set_bg_angles(ui_buttonUp, 310, 340);

  lv_obj_set_style_bg_color(ui_buttonUp, lv_color_hex(0xFFFFFF), LV_PART_KNOB | LV_STATE_DEFAULT);
  lv_obj_set_style_bg_opa(ui_buttonUp, 0, LV_PART_KNOB | LV_STATE_DEFAULT);

  // ui_buttonDown

  ui_buttonDown = lv_arc_create(ui_testScreen);

  lv_obj_set_width(ui_buttonDown, 240);
  lv_obj_set_height(ui_buttonDown, 240);

  lv_obj_set_x(ui_buttonDown, 0);
  lv_obj_set_y(ui_buttonDown, 0);

  lv_obj_set_align(ui_buttonDown, LV_ALIGN_CENTER);

  lv_arc_set_range(ui_buttonDown, 0, 1);
  lv_arc_set_value(ui_buttonDown, 0);
  lv_arc_set_bg_angles(ui_buttonDown, 380, 410);

  lv_obj_set_style_bg_color(ui_buttonDown, lv_color_hex(0xFFFFFF), LV_PART_KNOB | LV_STATE_DEFAULT);
  lv_obj_set_style_bg_opa(ui_buttonDown, 0, LV_PART_KNOB | LV_STATE_DEFAULT);

  // ui_scrollTest

  ui_scrollTest = lv_obj_create(ui_testScreen);

  lv_obj_set_width(ui_scrollTest, 240);
  lv_obj_set_height(ui_scrollTest, 240);

  lv_obj_set_x(ui_scrollTest, 0);
  lv_obj_set_y(ui_scrollTest, 0);

  lv_obj_set_align(ui_scrollTest, LV_ALIGN_CENTER);

  lv_obj_set_scrollbar_mode(ui_scrollTest, LV_SCROLLBAR_MODE_OFF);
  lv_obj_set_scroll_dir(ui_scrollTest, LV_DIR_VER);

  lv_obj_set_style_radius(ui_scrollTest, 120, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_bg_color(ui_scrollTest, lv_color_hex(0x000000), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_bg_opa(ui_scrollTest, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_border_width(ui_scrollTest, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_outline_width(ui_scrollTest, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_outline_pad(ui_scrollTest, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_pad_left(ui_scrollTest, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_pad_right(ui_scrollTest, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_pad_top(ui_scrollTest, 100, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_pad_bottom(ui_scrollTest, 70, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_vibrateText

  ui_vibrateText = lv_label_create(ui_scrollTest);

  lv_obj_set_width(ui_vibrateText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_vibrateText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_vibrateText, 25);
  lv_obj_set_y(ui_vibrateText, -50);

  lv_obj_set_align(ui_vibrateText, LV_ALIGN_CENTER);

  lv_label_set_text(ui_vibrateText, "Vibrate Test");

  // ui_buttonvibrate

  ui_buttonvibrate = lv_imgbtn_create(ui_scrollTest);
  lv_imgbtn_set_src(ui_buttonvibrate, LV_IMGBTN_STATE_RELEASED, NULL, &ui_img_vibrate_png, NULL);
  lv_imgbtn_set_src(ui_buttonvibrate, LV_IMGBTN_STATE_PRESSED, NULL, &ui_img_vibrate_png, NULL);

  lv_obj_set_height(ui_buttonvibrate, 24);
  lv_obj_set_width(ui_buttonvibrate, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_buttonvibrate, -51);
  lv_obj_set_y(ui_buttonvibrate, -50);

  lv_obj_set_align(ui_buttonvibrate, LV_ALIGN_CENTER);

  lv_obj_set_style_outline_color(ui_buttonvibrate, lv_color_hex(0xFFFFFF), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_outline_opa(ui_buttonvibrate, 255, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_outline_width(ui_buttonvibrate, 1, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_outline_pad(ui_buttonvibrate, 5, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_border_color(ui_buttonvibrate, lv_color_hex(0x22540C), LV_PART_MAIN | LV_STATE_PRESSED);
  lv_obj_set_style_border_opa(ui_buttonvibrate, 255, LV_PART_MAIN | LV_STATE_PRESSED);
  lv_obj_set_style_border_width(ui_buttonvibrate, 2, LV_PART_MAIN | LV_STATE_PRESSED);
  lv_obj_set_style_img_recolor(ui_buttonvibrate, lv_color_hex(0x2B258D),
                               LV_PART_MAIN | LV_STATE_CHECKED | LV_STATE_PRESSED);
  lv_obj_set_style_img_recolor_opa(ui_buttonvibrate, 255, LV_PART_MAIN | LV_STATE_CHECKED | LV_STATE_PRESSED);

  lv_obj_add_event_cb(ui_buttonvibrate, button_event_handler, LV_EVENT_ALL, NULL);

  // ui_accelerometerText

  ui_accelerometerText = lv_label_create(ui_scrollTest);

  lv_obj_set_width(ui_accelerometerText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_accelerometerText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_accelerometerText, 0);
  lv_obj_set_y(ui_accelerometerText, 10);

  lv_obj_set_align(ui_accelerometerText, LV_ALIGN_CENTER);

  lv_label_set_text(ui_accelerometerText, "Accelerometer");

  // ui_accXtext

  ui_accXtext = lv_label_create(ui_scrollTest);

  lv_obj_set_width(ui_accXtext, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_accXtext, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_accXtext, -75);
  lv_obj_set_y(ui_accXtext, 30);

  lv_obj_set_align(ui_accXtext, LV_ALIGN_CENTER);

