fbiego/dt78-esp32-firmware/src/main.cpp
  lv_label_set_text(ui_accXtext, "X");

  // ui_accXBar

  ui_accXBar = lv_bar_create(ui_scrollTest);
  lv_bar_set_range(ui_accXBar, 0, 100);
  lv_bar_set_value(ui_accXBar, 25, LV_ANIM_OFF);

  lv_obj_set_width(ui_accXBar, 150);
  lv_obj_set_height(ui_accXBar, 10);

  lv_obj_set_x(ui_accXBar, 10);
  lv_obj_set_y(ui_accXBar, 30);

  lv_obj_set_align(ui_accXBar, LV_ALIGN_CENTER);

  // ui_accYText

  ui_accYText = lv_label_create(ui_scrollTest);

  lv_obj_set_width(ui_accYText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_accYText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_accYText, -75);
  lv_obj_set_y(ui_accYText, 50);

  lv_obj_set_align(ui_accYText, LV_ALIGN_CENTER);

  lv_label_set_text(ui_accYText, "Y");

  // ui_accYBar

  ui_accYBar = lv_bar_create(ui_scrollTest);
  lv_bar_set_range(ui_accYBar, 0, 100);
  lv_bar_set_value(ui_accYBar, 25, LV_ANIM_OFF);

  lv_obj_set_width(ui_accYBar, 150);
  lv_obj_set_height(ui_accYBar, 10);

  lv_obj_set_x(ui_accYBar, 10);
  lv_obj_set_y(ui_accYBar, 50);

  lv_obj_set_align(ui_accYBar, LV_ALIGN_CENTER);

  // ui_accZText

  ui_accZText = lv_label_create(ui_scrollTest);

  lv_obj_set_width(ui_accZText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_accZText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_accZText, -75);
  lv_obj_set_y(ui_accZText, 70);

  lv_obj_set_align(ui_accZText, LV_ALIGN_CENTER);

  lv_label_set_text(ui_accZText, "Z");

  // ui_accZBar

  ui_accZBar = lv_bar_create(ui_scrollTest);
  lv_bar_set_range(ui_accZBar, 0, 100);
  lv_bar_set_value(ui_accZBar, 25, LV_ANIM_OFF);

  lv_obj_set_width(ui_accZBar, 150);
  lv_obj_set_height(ui_accZBar, 10);

  lv_obj_set_x(ui_accZBar, 10);
  lv_obj_set_y(ui_accZBar, 70);

  lv_obj_set_align(ui_accZBar, LV_ALIGN_CENTER);
}

void ui_aboutScreen_screen_init(void)
{

  // ui_aboutScreen

  ui_aboutScreen = lv_obj_create(NULL);

  lv_obj_clear_flag(ui_aboutScreen, LV_OBJ_FLAG_SCROLLABLE);

  lv_obj_set_style_bg_color(ui_aboutScreen, lv_color_hex(0x000000), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_bg_opa(ui_aboutScreen, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  lv_obj_add_event_cb(ui_aboutScreen, my_gesture, LV_EVENT_GESTURE, NULL);

  ui_aboutList = lv_obj_create(ui_aboutScreen);
  lv_obj_set_size(ui_aboutList, 240, 240);
  lv_obj_center(ui_aboutList);
  lv_obj_set_flex_flow(ui_aboutList, LV_FLEX_FLOW_COLUMN);
  lv_obj_add_event_cb(ui_aboutList, scroll_event_cb, LV_EVENT_SCROLL, NULL);
  lv_obj_set_style_radius(ui_aboutList, LV_RADIUS_CIRCLE, 0);
  lv_obj_set_style_clip_corner(ui_aboutList, true, 0);
  lv_obj_set_scroll_dir(ui_aboutList, LV_DIR_VER);
  lv_obj_set_scroll_snap_y(ui_aboutList, LV_SCROLL_SNAP_CENTER);
  lv_obj_set_scrollbar_mode(ui_aboutList, LV_SCROLLBAR_MODE_OFF);
  lv_obj_set_style_bg_color(ui_aboutList, lv_color_hex(0x000000), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_border_width(ui_aboutList, 0, LV_PART_MAIN | LV_STATE_DEFAULT);

  lv_obj_set_style_pad_top(ui_aboutList, 50, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_pad_bottom(ui_aboutList, 50, LV_PART_MAIN | LV_STATE_DEFAULT);

  lv_obj_t *info;
  //
  info = lv_list_add_btn(ui_aboutList, &ui_img_watch_png, "DT78 ESP32\nv1.0");
  set_style(info);
  String about = "Mac Address\n" + String(macAddr);
  info = lv_list_add_btn(ui_aboutList, &ui_img_bluetooth_png, about.c_str());
  set_style(info);
  about = "Touch Screen\nv" + String(touch_data.version15, HEX) + " (" + String(touch_data.versionInfo[0], HEX) + "-" + String(touch_data.versionInfo[0], HEX) + "-" + String(touch_data.versionInfo[0], HEX) + ")";
  info = lv_list_add_btn(ui_aboutList, &ui_img_touch_png, about.c_str());
  set_style(info);
  about = "Accelerometer\nv" + String(imuID, HEX);
  info = lv_list_add_btn(ui_aboutList, &ui_img_accl_png, about.c_str());

  set_style(info);
}

void ui_solarScreen_screen_init(void)
{

  // ui_solarScreen

  ui_solarScreen = lv_obj_create(NULL);

  lv_obj_clear_flag(ui_solarScreen, LV_OBJ_FLAG_SCROLLABLE);

  lv_obj_set_style_radius(ui_solarScreen, 120, LV_PART_MAIN | LV_STATE_DEFAULT);

  lv_obj_add_event_cb(ui_solarScreen, my_gesture, LV_EVENT_GESTURE, NULL);

  // ui_sStarsImage

  ui_sStarsImage = lv_img_create(ui_solarScreen);
  lv_img_set_src(ui_sStarsImage, &ui_img_stars_png);

  lv_obj_set_width(ui_sStarsImage, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_sStarsImage, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_sStarsImage, 0);
  lv_obj_set_y(ui_sStarsImage, 0);

  lv_obj_set_align(ui_sStarsImage, LV_ALIGN_CENTER);

  lv_obj_add_flag(ui_sStarsImage, LV_OBJ_FLAG_ADV_HITTEST);
  lv_obj_clear_flag(ui_sStarsImage, LV_OBJ_FLAG_SCROLLABLE);

  lv_obj_set_style_img_recolor(ui_sStarsImage, lv_color_hex(0x000000), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_img_recolor_opa(ui_sStarsImage, 200, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_Panel2

  lv_obj_t *rings;
  int r = 18;

  for (int i = 0; i < 9; i++)
  {
    rings = lv_obj_create(ui_solarScreen);

    lv_obj_set_width(rings, r * 2);
    lv_obj_set_height(rings, r * 2);

    lv_obj_set_x(rings, 0);
    lv_obj_set_y(rings, 0);

    lv_obj_set_align(rings, LV_ALIGN_CENTER);

    lv_obj_clear_flag(rings, LV_OBJ_FLAG_SCROLLABLE);

    lv_obj_set_style_radius(rings, r, LV_PART_MAIN | LV_STATE_DEFAULT);
    lv_obj_set_style_bg_color(rings, lv_color_hex(0xFFFFFF), LV_PART_MAIN | LV_STATE_DEFAULT);
    lv_obj_set_style_bg_opa(rings, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
    lv_obj_set_style_border_color(rings, lv_color_hex(0xFFFFFF), LV_PART_MAIN | LV_STATE_DEFAULT);
    lv_obj_set_style_border_opa(rings, 50, LV_PART_MAIN | LV_STATE_DEFAULT);
    lv_obj_set_style_border_width(rings, 1, LV_PART_MAIN | LV_STATE_DEFAULT);

    r += 12;
  }

  // ui_sMercury

  ui_sMercury = lv_img_create(ui_solarScreen);
  lv_img_set_src(ui_sMercury, &ui_img_mercury_png);

  lv_obj_set_width(ui_sMercury, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_sMercury, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_sMercury, -17);
  lv_obj_set_y(ui_sMercury, 0);

  lv_obj_set_align(ui_sMercury, LV_ALIGN_CENTER);

  lv_obj_add_flag(ui_sMercury, LV_OBJ_FLAG_ADV_HITTEST);
  lv_obj_clear_flag(ui_sMercury, LV_OBJ_FLAG_SCROLLABLE);

  // ui_sVenus

  ui_sVenus = lv_img_create(ui_solarScreen);
  lv_img_set_src(ui_sVenus, &ui_img_venus_png);

  lv_obj_set_width(ui_sVenus, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_sVenus, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_sVenus, 9);
  lv_obj_set_y(ui_sVenus, -28);

