fbiego/dt78-esp32-firmware/src/main.cpp
  lv_obj_set_align(ui_sVenus, LV_ALIGN_CENTER);

  lv_obj_add_flag(ui_sVenus, LV_OBJ_FLAG_ADV_HITTEST);
  lv_obj_clear_flag(ui_sVenus, LV_OBJ_FLAG_SCROLLABLE);

  // ui_sEarth

  ui_sEarth = lv_img_create(ui_solarScreen);
  lv_img_set_src(ui_sEarth, &ui_img_earth_png);

  lv_obj_set_width(ui_sEarth, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_sEarth, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_sEarth, 25);
  lv_obj_set_y(ui_sEarth, 33);

  lv_obj_set_align(ui_sEarth, LV_ALIGN_CENTER);

  lv_obj_add_flag(ui_sEarth, LV_OBJ_FLAG_ADV_HITTEST);
  lv_obj_clear_flag(ui_sEarth, LV_OBJ_FLAG_SCROLLABLE);

  // ui_sMars

  ui_sMars = lv_img_create(ui_solarScreen);
  lv_img_set_src(ui_sMars, &ui_img_mars_png);

  lv_obj_set_width(ui_sMars, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_sMars, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_sMars, 53);
  lv_obj_set_y(ui_sMars, -1);

  lv_obj_set_align(ui_sMars, LV_ALIGN_CENTER);

  lv_obj_add_flag(ui_sMars, LV_OBJ_FLAG_ADV_HITTEST);
  lv_obj_clear_flag(ui_sMars, LV_OBJ_FLAG_SCROLLABLE);

  // ui_sJupiter

  ui_sJupiter = lv_img_create(ui_solarScreen);
  lv_img_set_src(ui_sJupiter, &ui_img_jupiter_png);

  lv_obj_set_width(ui_sJupiter, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_sJupiter, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_sJupiter, 65);
  lv_obj_set_y(ui_sJupiter, 2);

  lv_obj_set_align(ui_sJupiter, LV_ALIGN_CENTER);

  lv_obj_add_flag(ui_sJupiter, LV_OBJ_FLAG_ADV_HITTEST);
  lv_obj_clear_flag(ui_sJupiter, LV_OBJ_FLAG_SCROLLABLE);

  // ui_sSaturn

  ui_sSaturn = lv_img_create(ui_solarScreen);
  lv_img_set_src(ui_sSaturn, &ui_img_saturn_png);

  lv_obj_set_width(ui_sSaturn, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_sSaturn, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_sSaturn, 60);
  lv_obj_set_y(ui_sSaturn, 48);

  lv_obj_set_align(ui_sSaturn, LV_ALIGN_CENTER);

  lv_obj_add_flag(ui_sSaturn, LV_OBJ_FLAG_ADV_HITTEST);
  lv_obj_clear_flag(ui_sSaturn, LV_OBJ_FLAG_SCROLLABLE);

  // ui_sUranus

  ui_sUranus = lv_img_create(ui_solarScreen);
  lv_img_set_src(ui_sUranus, &ui_img_uranus_png);

  lv_obj_set_width(ui_sUranus, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_sUranus, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_sUranus, 62);
  lv_obj_set_y(ui_sUranus, -64);

  lv_obj_set_align(ui_sUranus, LV_ALIGN_CENTER);

  lv_obj_add_flag(ui_sUranus, LV_OBJ_FLAG_ADV_HITTEST);
  lv_obj_clear_flag(ui_sUranus, LV_OBJ_FLAG_SCROLLABLE);

  // ui_sNeptune

  ui_sNeptune = lv_img_create(ui_solarScreen);
  lv_img_set_src(ui_sNeptune, &ui_img_neptune_png);

  lv_obj_set_width(ui_sNeptune, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_sNeptune, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_sNeptune, 101);
  lv_obj_set_y(ui_sNeptune, 11);

  lv_obj_set_align(ui_sNeptune, LV_ALIGN_CENTER);

  lv_obj_add_flag(ui_sNeptune, LV_OBJ_FLAG_ADV_HITTEST);
  lv_obj_clear_flag(ui_sNeptune, LV_OBJ_FLAG_SCROLLABLE);

  // ui_sPluto

  ui_sPluto = lv_img_create(ui_solarScreen);
  lv_img_set_src(ui_sPluto, &ui_img_pluto_png);

  lv_obj_set_width(ui_sPluto, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_sPluto, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_sPluto, 51);
  lv_obj_set_y(ui_sPluto, 101);

  lv_obj_set_align(ui_sPluto, LV_ALIGN_CENTER);

  lv_obj_add_flag(ui_sPluto, LV_OBJ_FLAG_ADV_HITTEST);
  lv_obj_clear_flag(ui_sPluto, LV_OBJ_FLAG_SCROLLABLE);

  // ui_sClock

  ui_sClock = lv_meter_create(ui_solarScreen);
  lv_obj_set_size(ui_sClock, 240, 240);
  lv_obj_center(ui_sClock);

  lv_obj_remove_style(ui_sClock, NULL, LV_PART_INDICATOR);
  // lv_obj_set_style_bg_color(ui_sClock, lv_color_hex(0x09FCE0), LV_PART_INDICATOR | LV_STATE_DEFAULT);

  lv_obj_set_style_bg_opa(ui_sClock, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_border_opa(ui_sClock, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_outline_opa(ui_sClock, 0, LV_PART_MAIN | LV_STATE_DEFAULT);

  /*Add a scale first*/
  lv_meter_scale_t *scale = lv_meter_add_scale(ui_sClock);
  // lv_meter_set_scale_ticks(ui_sClock, scale, 11, 2, 10, lv_palette_main(LV_PALETTE_GREY));
  // lv_meter_set_scale_major_ticks(ui_sClock, scale, 1, 2, 30, lv_color_hex3(0xeee), 15);
  lv_meter_set_scale_range(ui_sClock, scale, 0, 600, 360, -90);

  sHour = lv_meter_add_needle_line(ui_sClock, scale, 4, lv_color_hex(0xFFFFFF), -30);
  sMinute = lv_meter_add_needle_line(ui_sClock, scale, 3, lv_color_hex(0xFFFFFF), -10);
  sSecond = lv_meter_add_needle_line(ui_sClock, scale, 2, lv_color_hex(0xFFFFFF), -5);

  // ui_sSun

  ui_sSun = lv_img_create(ui_solarScreen);
  lv_img_set_src(ui_sSun, &ui_img_sun_png);

  lv_obj_set_width(ui_sSun, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_sSun, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_sSun, 0);
  lv_obj_set_y(ui_sSun, 0);

  lv_obj_set_align(ui_sSun, LV_ALIGN_CENTER);

  lv_obj_add_flag(ui_sSun, LV_OBJ_FLAG_ADV_HITTEST);
  lv_obj_clear_flag(ui_sSun, LV_OBJ_FLAG_SCROLLABLE);
}

void ui_aWatch_screen_init(void)
{

  // ui_aWatch

  ui_aWatch = lv_obj_create(NULL);

  lv_obj_clear_flag(ui_aWatch, LV_OBJ_FLAG_SCROLLABLE);

  lv_obj_set_style_bg_color(ui_aWatch, lv_color_hex(0x000000), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_bg_opa(ui_aWatch, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  lv_obj_add_event_cb(ui_aWatch, my_gesture, LV_EVENT_GESTURE, NULL);

  // ui_aBackground

  ui_aBackground = lv_img_create(ui_aWatch);
  lv_img_set_src(ui_aBackground, &ui_img_inked4_png);

  lv_obj_set_width(ui_aBackground, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_aBackground, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_aBackground, 0);
  lv_obj_set_y(ui_aBackground, 0);

  lv_obj_set_align(ui_aBackground, LV_ALIGN_CENTER);

  lv_obj_add_flag(ui_aBackground, LV_OBJ_FLAG_ADV_HITTEST);
  lv_obj_clear_flag(ui_aBackground, LV_OBJ_FLAG_SCROLLABLE);

  // ui_aWatchBat

  ui_aWatchBat = lv_arc_create(ui_aWatch);

  lv_obj_set_width(ui_aWatchBat, 180);
  lv_obj_set_height(ui_aWatchBat, 180);

  lv_obj_set_x(ui_aWatchBat, 0);
  lv_obj_set_y(ui_aWatchBat, 0);

  lv_obj_set_align(ui_aWatchBat, LV_ALIGN_CENTER);

  lv_arc_set_range(ui_aWatchBat, 0, 100);
  lv_arc_set_value(ui_aWatchBat, 40);
  lv_arc_set_bg_angles(ui_aWatchBat, 150, 210);

