fbiego/dt78-esp32-firmware/src/main.cpp
  lv_obj_set_style_arc_color(ui_aWatchBat, lv_color_hex(0x04221E), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_arc_opa(ui_aWatchBat, 255, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_arc_width(ui_aWatchBat, 6, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_arc_rounded(ui_aWatchBat, false, LV_PART_MAIN | LV_STATE_DEFAULT);

  lv_obj_set_style_arc_color(ui_aWatchBat, lv_color_hex(0x09FCE0), LV_PART_INDICATOR | LV_STATE_DEFAULT);
  lv_obj_set_style_arc_opa(ui_aWatchBat, 255, LV_PART_INDICATOR | LV_STATE_DEFAULT);
  lv_obj_set_style_arc_width(ui_aWatchBat, 6, LV_PART_INDICATOR | LV_STATE_DEFAULT);
  lv_obj_set_style_arc_rounded(ui_aWatchBat, false, LV_PART_INDICATOR | LV_STATE_DEFAULT);

  lv_obj_set_style_bg_color(ui_aWatchBat, lv_color_hex(0xFFFFFF), LV_PART_KNOB | LV_STATE_DEFAULT);
  lv_obj_set_style_bg_opa(ui_aWatchBat, 0, LV_PART_KNOB | LV_STATE_DEFAULT);

  // ui_aHeartRate

  ui_aHeartRate = lv_arc_create(ui_aWatch);

  lv_obj_set_width(ui_aHeartRate, 180);
  lv_obj_set_height(ui_aHeartRate, 180);

  lv_obj_set_x(ui_aHeartRate, 0);
  lv_obj_set_y(ui_aHeartRate, 0);

  lv_obj_set_align(ui_aHeartRate, LV_ALIGN_CENTER);

  lv_arc_set_range(ui_aHeartRate, 0, 100);
  lv_arc_set_value(ui_aHeartRate, 35);
  lv_arc_set_bg_angles(ui_aHeartRate, 330, 30);
  lv_arc_set_mode(ui_aHeartRate, LV_ARC_MODE_REVERSE);

  lv_obj_set_style_arc_color(ui_aHeartRate, lv_color_hex(0x04221E), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_arc_opa(ui_aHeartRate, 255, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_arc_width(ui_aHeartRate, 6, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_arc_rounded(ui_aHeartRate, false, LV_PART_MAIN | LV_STATE_DEFAULT);

  lv_obj_set_style_arc_color(ui_aHeartRate, lv_color_hex(0x09FCE0), LV_PART_INDICATOR | LV_STATE_DEFAULT);
  lv_obj_set_style_arc_opa(ui_aHeartRate, 255, LV_PART_INDICATOR | LV_STATE_DEFAULT);
  lv_obj_set_style_arc_width(ui_aHeartRate, 6, LV_PART_INDICATOR | LV_STATE_DEFAULT);
  lv_obj_set_style_arc_rounded(ui_aHeartRate, false, LV_PART_INDICATOR | LV_STATE_DEFAULT);

  lv_obj_set_style_bg_color(ui_aHeartRate, lv_color_hex(0xFFFFFF), LV_PART_KNOB | LV_STATE_DEFAULT);
  lv_obj_set_style_bg_opa(ui_aHeartRate, 0, LV_PART_KNOB | LV_STATE_DEFAULT);

  // ui_aDayText

  ui_aDayText = lv_label_create(ui_aWatch);

  lv_obj_set_width(ui_aDayText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_aDayText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_aDayText, 0);
  lv_obj_set_y(ui_aDayText, 50);

  lv_obj_set_align(ui_aDayText, LV_ALIGN_CENTER);

  lv_label_set_text(ui_aDayText, "13");

  // ui_aDT78label

  ui_aDT78label = lv_label_create(ui_aWatch);

  lv_obj_set_width(ui_aDT78label, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_aDT78label, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_aDT78label, 0);
  lv_obj_set_y(ui_aDT78label, 5);

  lv_obj_set_align(ui_aDT78label, LV_ALIGN_TOP_MID);

  lv_label_set_text(ui_aDT78label, "DT78");

  lv_obj_set_style_text_color(ui_aDT78label, lv_color_hex(0x08FFE6), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_opa(ui_aDT78label, 255, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_font(ui_aDT78label, &lv_font_montserrat_12, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_aWeekText

  ui_aWeekText = lv_label_create(ui_aWatch);

  lv_obj_set_width(ui_aWeekText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_aWeekText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_aWeekText, 0);
  lv_obj_set_y(ui_aWeekText, -5);

  lv_obj_set_align(ui_aWeekText, LV_ALIGN_BOTTOM_MID);

  lv_label_set_text(ui_aWeekText, "Mon");

  lv_obj_set_style_text_font(ui_aWeekText, &lv_font_montserrat_12, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_aClock

  ui_aClock = lv_meter_create(ui_aWatch);
  lv_obj_set_size(ui_aClock, 240, 240);
  lv_obj_center(ui_aClock);

  // lv_obj_remove_style(ui_aClock, NULL, LV_PART_INDICATOR);
  lv_obj_set_style_bg_color(ui_aClock, lv_color_hex(0x09FCE0), LV_PART_INDICATOR | LV_STATE_DEFAULT);
  lv_obj_set_style_border_opa(ui_aClock, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_outline_opa(ui_aClock, 0, LV_PART_MAIN | LV_STATE_DEFAULT);

  lv_obj_set_style_bg_opa(ui_aClock, 0, LV_PART_MAIN | LV_STATE_DEFAULT);

  /*Add a scale first*/
  lv_meter_scale_t *scale = lv_meter_add_scale(ui_aClock);
  // lv_meter_set_scale_ticks(ui_aClock, scale, 11, 2, 10, lv_palette_main(LV_PALETTE_GREY));
  // lv_meter_set_scale_major_ticks(ui_aClock, scale, 1, 2, 30, lv_color_hex3(0xeee), 15);
  lv_meter_set_scale_range(ui_aClock, scale, 0, 600, 360, -90);

  aHour = lv_meter_add_needle_line(ui_aClock, scale, 4, lv_color_hex(0x09FCE0), -30);
  aMinute = lv_meter_add_needle_line(ui_aClock, scale, 3, lv_color_hex(0x09FCE0), -10);
  aSecond = lv_meter_add_needle_line(ui_aClock, scale, 2, lv_color_hex(0xFFFFFF), -5);
}

void ui_gWatch_screen_init(void)
{

  // ui_gWatch

  ui_gWatch = lv_obj_create(NULL);

  lv_obj_clear_flag(ui_gWatch, LV_OBJ_FLAG_SCROLLABLE);

  lv_obj_add_event_cb(ui_gWatch, my_gesture, LV_EVENT_GESTURE, NULL);

  // ui_gBackground

  ui_gBackground = lv_img_create(ui_gWatch);
  lv_img_set_src(ui_gBackground, &ui_img_inked3_png);

  lv_obj_set_width(ui_gBackground, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_gBackground, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_gBackground, 0);
  lv_obj_set_y(ui_gBackground, 0);

  lv_obj_set_align(ui_gBackground, LV_ALIGN_CENTER);

  lv_obj_add_flag(ui_gBackground, LV_OBJ_FLAG_ADV_HITTEST);
  lv_obj_clear_flag(ui_gBackground, LV_OBJ_FLAG_SCROLLABLE);

  // ui_gWeatherText

  ui_gWeatherText = lv_label_create(ui_gWatch);

  lv_obj_set_width(ui_gWeatherText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_gWeatherText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_gWeatherText, -56);
  lv_obj_set_y(ui_gWeatherText, 55);

  lv_obj_set_align(ui_gWeatherText, LV_ALIGN_CENTER);

  lv_label_set_text(ui_gWeatherText, "16°C");

  lv_obj_set_style_text_font(ui_gWeatherText, &lv_font_montserrat_14, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_gMinuteText

  ui_gMinuteText = lv_label_create(ui_gWatch);

  lv_obj_set_width(ui_gMinuteText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_gMinuteText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_gMinuteText, 40);
  lv_obj_set_y(ui_gMinuteText, -28);

  lv_obj_set_align(ui_gMinuteText, LV_ALIGN_CENTER);

  lv_label_set_text(ui_gMinuteText, "16");

  lv_obj_set_style_text_font(ui_gMinuteText, &lv_font_montserrat_48, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_gHourText

