fbiego/dt78-esp32-firmware/src/main.cpp
  ui_gHourText = lv_label_create(ui_gWatch);

  lv_obj_set_width(ui_gHourText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_gHourText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_gHourText, -40);
  lv_obj_set_y(ui_gHourText, -28);

  lv_obj_set_align(ui_gHourText, LV_ALIGN_CENTER);

  lv_label_set_text(ui_gHourText, "20");

  lv_obj_set_style_text_font(ui_gHourText, &lv_font_montserrat_48, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_gHeartText

  ui_gHeartText = lv_label_create(ui_gWatch);

  lv_obj_set_width(ui_gHeartText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_gHeartText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_gHeartText, -19);
  lv_obj_set_y(ui_gHeartText, 55);

  lv_obj_set_align(ui_gHeartText, LV_ALIGN_CENTER);

  lv_label_set_text(ui_gHeartText, "78");

  lv_obj_set_style_text_font(ui_gHeartText, &lv_font_montserrat_14, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_gPhoneBat

  ui_gPhoneBat = lv_label_create(ui_gWatch);

  lv_obj_set_width(ui_gPhoneBat, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_gPhoneBat, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_gPhoneBat, 57);
  lv_obj_set_y(ui_gPhoneBat, 55);

  lv_obj_set_align(ui_gPhoneBat, LV_ALIGN_CENTER);

  lv_label_set_text(ui_gPhoneBat, "95%");

  lv_obj_set_style_text_font(ui_gPhoneBat, &lv_font_montserrat_14, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_gWatchBat

  ui_gWatchBat = lv_label_create(ui_gWatch);

  lv_obj_set_width(ui_gWatchBat, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_gWatchBat, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_gWatchBat, 20);
  lv_obj_set_y(ui_gWatchBat, 55);

  lv_obj_set_align(ui_gWatchBat, LV_ALIGN_CENTER);

  lv_label_set_text(ui_gWatchBat, "76%");

  lv_obj_set_style_text_font(ui_gWatchBat, &lv_font_montserrat_14, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_gDateText

  ui_gDateText = lv_label_create(ui_gWatch);

  lv_obj_set_width(ui_gDateText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_gDateText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_gDateText, 0);
  lv_obj_set_y(ui_gDateText, 7);

  lv_obj_set_align(ui_gDateText, LV_ALIGN_CENTER);

  lv_label_set_text(ui_gDateText, "Saturday 20 June");

  lv_obj_set_style_text_color(ui_gDateText, lv_color_hex(0xB1B1B1), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_opa(ui_gDateText, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_gStepsText

  ui_gStepsText = lv_label_create(ui_gWatch);

  lv_obj_set_width(ui_gStepsText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_gStepsText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_gStepsText, 0);
  lv_obj_set_y(ui_gStepsText, 84);

  lv_obj_set_align(ui_gStepsText, LV_ALIGN_CENTER);

  lv_label_set_text(ui_gStepsText, "1024 Steps");

  lv_obj_set_style_text_font(ui_gStepsText, &lv_font_montserrat_12, LV_PART_MAIN | LV_STATE_DEFAULT);
}

void ui_hWatch_screen_init(void)
{

  // ui_hWatch

  ui_hWatch = lv_obj_create(NULL);

  lv_obj_clear_flag(ui_hWatch, LV_OBJ_FLAG_SCROLLABLE);

  lv_obj_set_style_bg_color(ui_hWatch, lv_color_hex(0x000000), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_bg_opa(ui_hWatch, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  lv_obj_add_event_cb(ui_hWatch, my_gesture, LV_EVENT_GESTURE, NULL);

  // ui_hHeaderText

  ui_hHeaderText = lv_label_create(ui_hWatch);

  lv_obj_set_width(ui_hHeaderText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_hHeaderText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_hHeaderText, 80);
  lv_obj_set_y(ui_hHeaderText, -70);

  lv_obj_set_align(ui_hHeaderText, LV_ALIGN_LEFT_MID);

  lv_label_set_text(ui_hHeaderText, "C:/> watch");

  lv_obj_set_style_text_color(ui_hHeaderText, lv_color_hex(0x14A014), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_opa(ui_hHeaderText, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_hDateLabel

  ui_hDateLabel = lv_label_create(ui_hWatch);

  lv_obj_set_width(ui_hDateLabel, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_hDateLabel, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_hDateLabel, -120);
  lv_obj_set_y(ui_hDateLabel, -10);

  lv_obj_set_align(ui_hDateLabel, LV_ALIGN_RIGHT_MID);

  lv_label_set_text(ui_hDateLabel, "date : ");

  lv_obj_set_style_text_color(ui_hDateLabel, lv_color_hex(0x14A014), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_opa(ui_hDateLabel, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_hDaylabel

  ui_hDaylabel = lv_label_create(ui_hWatch);

  lv_obj_set_width(ui_hDaylabel, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_hDaylabel, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_hDaylabel, -120);
  lv_obj_set_y(ui_hDaylabel, -30);

  lv_obj_set_align(ui_hDaylabel, LV_ALIGN_RIGHT_MID);

  lv_label_set_text(ui_hDaylabel, "day : ");

  lv_obj_set_style_text_color(ui_hDaylabel, lv_color_hex(0x14A014), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_opa(ui_hDaylabel, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_hTimeLabel

  ui_hTimeLabel = lv_label_create(ui_hWatch);

  lv_obj_set_width(ui_hTimeLabel, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_hTimeLabel, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_hTimeLabel, -120);
  lv_obj_set_y(ui_hTimeLabel, -50);

  lv_obj_set_align(ui_hTimeLabel, LV_ALIGN_RIGHT_MID);

  lv_label_set_text(ui_hTimeLabel, "time : ");

  lv_obj_set_style_text_color(ui_hTimeLabel, lv_color_hex(0x14A014), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_opa(ui_hTimeLabel, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_hStepsLabel

  ui_hStepsLabel = lv_label_create(ui_hWatch);

  lv_obj_set_width(ui_hStepsLabel, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_hStepsLabel, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_hStepsLabel, -120);
  lv_obj_set_y(ui_hStepsLabel, 10);

  lv_obj_set_align(ui_hStepsLabel, LV_ALIGN_RIGHT_MID);

  lv_label_set_text(ui_hStepsLabel, "steps : ");

  lv_obj_set_style_text_color(ui_hStepsLabel, lv_color_hex(0x14A014), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_opa(ui_hStepsLabel, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_hHeartLabel

  ui_hHeartLabel = lv_label_create(ui_hWatch);

  lv_obj_set_width(ui_hHeartLabel, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_hHeartLabel, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_hHeartLabel, -120);
  lv_obj_set_y(ui_hHeartLabel, 50);

  lv_obj_set_align(ui_hHeartLabel, LV_ALIGN_RIGHT_MID);

  lv_label_set_text(ui_hHeartLabel, "heart : ");

