fbiego/dt78-esp32-firmware/src/main.cpp
  lv_obj_set_style_text_color(ui_hHeartLabel, lv_color_hex(0x14A014), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_opa(ui_hHeartLabel, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_hBatteryLabel

  ui_hBatteryLabel = lv_label_create(ui_hWatch);

  lv_obj_set_width(ui_hBatteryLabel, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_hBatteryLabel, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_hBatteryLabel, -120);
  lv_obj_set_y(ui_hBatteryLabel, 30);

  lv_obj_set_align(ui_hBatteryLabel, LV_ALIGN_RIGHT_MID);

  lv_label_set_text(ui_hBatteryLabel, "battery : ");

  lv_obj_set_style_text_color(ui_hBatteryLabel, lv_color_hex(0x14A014), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_opa(ui_hBatteryLabel, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_hEndLabel

  ui_hEndLabel = lv_label_create(ui_hWatch);

  lv_obj_set_width(ui_hEndLabel, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_hEndLabel, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_hEndLabel, 80);
  lv_obj_set_y(ui_hEndLabel, 90);

  lv_obj_set_align(ui_hEndLabel, LV_ALIGN_LEFT_MID);

  lv_label_set_text(ui_hEndLabel, "C:/>_");

  lv_obj_set_style_text_color(ui_hEndLabel, lv_color_hex(0x14A014), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_opa(ui_hEndLabel, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_hStepsText

  ui_hStepsText = lv_label_create(ui_hWatch);

  lv_obj_set_width(ui_hStepsText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_hStepsText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_hStepsText, 120);
  lv_obj_set_y(ui_hStepsText, 10);

  lv_obj_set_align(ui_hStepsText, LV_ALIGN_LEFT_MID);

  lv_label_set_text(ui_hStepsText, "1024 Steps");

  lv_obj_set_style_text_color(ui_hStepsText, lv_color_hex(0x14A014), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_opa(ui_hStepsText, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_hDateText

  ui_hDateText = lv_label_create(ui_hWatch);

  lv_obj_set_width(ui_hDateText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_hDateText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_hDateText, 120);
  lv_obj_set_y(ui_hDateText, -10);

  lv_obj_set_align(ui_hDateText, LV_ALIGN_LEFT_MID);

  lv_label_set_text(ui_hDateText, "22-07-2022");

  lv_obj_set_style_text_color(ui_hDateText, lv_color_hex(0x14A014), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_opa(ui_hDateText, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_hDayText

  ui_hDayText = lv_label_create(ui_hWatch);

  lv_obj_set_width(ui_hDayText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_hDayText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_hDayText, 120);
  lv_obj_set_y(ui_hDayText, -30);

  lv_obj_set_align(ui_hDayText, LV_ALIGN_LEFT_MID);

  lv_label_set_text(ui_hDayText, "Monday");

  lv_obj_set_style_text_color(ui_hDayText, lv_color_hex(0x14A014), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_opa(ui_hDayText, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_hTineText

  ui_hTineText = lv_label_create(ui_hWatch);

  lv_obj_set_width(ui_hTineText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_hTineText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_hTineText, 120);
  lv_obj_set_y(ui_hTineText, -50);

  lv_obj_set_align(ui_hTineText, LV_ALIGN_LEFT_MID);

  lv_label_set_text(ui_hTineText, "12:36:28");

  lv_obj_set_style_text_color(ui_hTineText, lv_color_hex(0x14A014), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_opa(ui_hTineText, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_hHeartText

  ui_hHeartText = lv_label_create(ui_hWatch);

  lv_obj_set_width(ui_hHeartText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_hHeartText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_hHeartText, 120);
  lv_obj_set_y(ui_hHeartText, 50);

  lv_obj_set_align(ui_hHeartText, LV_ALIGN_LEFT_MID);

  lv_label_set_text(ui_hHeartText, "76 bpm");

  lv_obj_set_style_text_color(ui_hHeartText, lv_color_hex(0x14A014), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_opa(ui_hHeartText, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_hBatteryText

  ui_hBatteryText = lv_label_create(ui_hWatch);

  lv_obj_set_width(ui_hBatteryText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_hBatteryText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_hBatteryText, 120);
  lv_obj_set_y(ui_hBatteryText, 30);

  lv_obj_set_align(ui_hBatteryText, LV_ALIGN_LEFT_MID);

  lv_label_set_text(ui_hBatteryText, "76%");

  lv_obj_set_style_text_color(ui_hBatteryText, lv_color_hex(0x14A014), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_opa(ui_hBatteryText, 255, LV_PART_MAIN | LV_STATE_DEFAULT);

  // ui_hEpochText

  ui_hEpochText = lv_label_create(ui_hWatch);

  lv_obj_set_width(ui_hEpochText, LV_SIZE_CONTENT);
  lv_obj_set_height(ui_hEpochText, LV_SIZE_CONTENT);

  lv_obj_set_x(ui_hEpochText, 0);
  lv_obj_set_y(ui_hEpochText, 70);

  lv_obj_set_align(ui_hEpochText, LV_ALIGN_CENTER);

  lv_label_set_text(ui_hEpochText, "24389564936");

  lv_obj_set_style_text_color(ui_hEpochText, lv_color_hex(0x14A014), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_text_opa(ui_hEpochText, 255, LV_PART_MAIN | LV_STATE_DEFAULT);
}
